Revit 2027 API
ThermalAsset.Copy Method
 Produces a copy of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ThermalAsset Copy()
Public Function Copy As ThermalAsset
public:
ThermalAsset^ Copy()
member Copy : unit -> ThermalAsset
Return Value
ThermalAsset
 A copy of the asset.
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace